app/views/games/show.html.erb

  <input type='submit' value='Next' id='next-btn' class='btns'>
  <input name='total_moves' type='hidden' value='<%= @moves.count %>'>
---
SELECT "moves".* FROM "moves"  WHERE "moves"."game_id" = $1  [["game_id", 1]]
SELECT COUNT(*) FROM "moves"  WHERE "moves"."game_id" = $1  [["game_id", 1]]