app/views/layouts/_header.html.erb

SELECT COUNT(*) FROM "games"
---
    <li class='left-nav'>
      <% num = Game.count %>